Revit 2027 API
ElementIntersectsFilter.IsElementSupported Method
 Identifies if the input element is supported by element intersection filters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsElementSupported(
	Element element
)
Public Shared Function IsElementSupported (
	element As Element
) As Boolean
public:
static bool IsElementSupported(
	Element^ element
)
static member IsElementSupported :
        element : Element -> bool
Parameters
element Element
 The element.
Return Value
Boolean
 True if the element is supported, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIntersectsFilter Class
Autodesk.Revit.DB Namespace